# Представлен список чисел. Необходимо вывести элементы исходного списка, значения которых больше предыдущего элемента.
# Подсказка: элементы, удовлетворяющие условию, оформить в виде списка. Для формирования списка использовать генератор.
# Пример исходного списка: [300, 2, 12, 44, 1, 1, 4, 10, 7, 1, 78, 123, 55].
# Результат: [12, 44, 4, 10, 78, 123].


from random import randint
my_list = [randint(-10, 10) for _ in range(20)]
print(my_list)
i = 0
new_my_list = []
while i < len(my_list) - 1:
    if my_list[i + 1] > my_list[i]:
        new_my_list.append(my_list[i + 1])
    i += 1
print(new_my_list)
