#  Реализовать два небольших скрипта:
# а) итератор, генерирующий целые числа, начиная с указанного,
# б) итератор, повторяющий элементы некоторого списка, определенного заранее.

# Подсказка: использовать функцию count() и cycle() модуля itertools. Обратите внимание,
# что создаваемый цикл не должен быть бесконечным. Необходимо предусмотреть условие его завершения.
# Например, в первом задании выводим целые числа, начиная с 3, а при достижении числа 10 завершаем цикл.
# Во втором также необходимо предусмотреть условие, при котором повторение элементов списка будет прекращено.


from itertools import count, cycle


def gen_number():
    my_list = []
    for el in count(3):
        if el > 10:
            break
        else:
            my_list.append(el)
    return my_list


print(gen_number())


def my_def():
    i = 0
    for el in cycle(gen_number()):
        if i < 20:
            print(el)
            i += 1
        else:
            break


my_def()
