#Запросите у пользователя значения выручки и издержек фирмы. Определите, с каким финансовым результатом работает фирма
# (прибыль — выручка больше издержек, или убыток — издержки больше выручки). Выведите соответствующее сообщение.
# Если фирма отработала с прибылью, вычислите рентабельность выручки (соотношение прибыли к выручке).
# Далее запросите численность сотрудников фирмы и определите прибыль фирмы в расчете на одного сотрудника.

debit = int(input("Введите значение выручки "))
credit = int(input("Введите значение издержек "))
if debit > credit:
    print("Ваша фирма приносит прибыль!", debit-credit, "руб.")
    print("Рентабельность составляет ", ((debit-credit)/debit)*100, "%")
    staff = int(input("Введите количество сотрудников "))
    print("Прибыль в расчете на каждого сотрудника составляет ", ((debit-credit)/staff):02), "руб.")
else:
    print("Ваша фирма в убытке ", debit-credit, "руб.")