# Спортсмен занимается ежедневными пробежками. В первый день его результат составил a километров.
# Каждый день спортсмен увеличивал результат на 10 % относительно предыдущего. Требуется определить номер дня,
# на который общий результат спортсмена составить не менее b километров. Программа должна принимать
# значения параметров a и b и выводить одно натуральное число — номер дня.
distance = int(input("Введите начальный километраж "))
max_distance = int(input("Введите конечный километраж "))
day_number = 0
while distance < max_distance:
    day_number += 1
    distance = distance + distance/10
print("Номер дня", day_number)

