#Пользователь вводит время в секундах. Переведите время в часы, минуты и секунды
# и выведите в формате чч:мм:сс. Используйте форматирование строк.

sec = int(input('введите число в секундах: \n'))
hh =sec//3600
mm = (sec - hh*3600)//60
ss = sec-(hh*3600+mm*60)
print(f'{hh:02}:{mm:02}:{ss:02}')