# Программа принимает действительное положительное число x и целое отрицательное число y.
# Необходимо выполнить возведение числа x в степень y. Задание необходимо реализовать в виде функции my_func(x, y).
# При решении задания необходимо обойтись без встроенной функции возведения числа в степень.
# Подсказка: попробуйте решить задачу двумя способами. Первый — возведение в степень с помощью оператора **
#  Второй — более сложная реализация без оператора **, предусматривающая использование цикла.


def my_func(x, y):
    return x ** y


print(my_func(2, -3))


def my_func(x, y):
    a = 0
    y = abs(y)
    while y >= 0:
        a = a + x
        y -= 1
    rez = 1/a
    return rez


print(my_func(2, -3))
