#Реализовать функцию, принимающую два числа (позиционные аргументы) и выполняющую их деление.
# Числа запрашивать у пользователя, предусмотреть обработку ситуации деления на ноль.

def my_div(arg1, arg2):
    try:
        print("результат = ", (arg1/arg2).__round__(2))
    except ZeroDivisionError:
        print("на ноль делить нельзя!")


num1 = int(input("введите певое число "))
num2 = int(input("введите второе число "))
my_div(num1, num2)






