# Реализовать класс Matrix (матрица). Обеспечить перегрузку конструктора класса (метод __init__()),
# который должен принимать данные (список списков) для формирования матрицы.
# Подсказка: матрица — система некоторых математических величин, расположенных в виде прямоугольной схемы.
# Примеры матриц вы найдете в методичке.
# Следующий шаг — реализовать перегрузку метода __str__() для вывода матрицы в привычном виде.
# Далее реализовать перегрузку метода __add__() для реализации операции сложения двух объектов класса Matrix (двух матриц).
# Результатом сложения должна быть новая матрица.
# Подсказка: сложение элементов матриц выполнять поэлементно — первый элемент первой строки первой матрицы складываем
# с первым элементом первой строки второй матрицы и т.д.


class Matrix:

    def __init__(self, args):
        self.args = args

    def __str__(self):
        print("Исходная матрица")
        for i in self.args:
            for j in i:
                print(j, end=" ")
            print()

    def __add__(self, other):
        rez = item = []
        for i in range(len(self.args)):
            for j in range(len(self.args[i])):
                rez.append(self.args[i][j] + other.args[i][j])
        item = [rez[:3:]] + [rez[3:6:]]
        return item


a = Matrix([[1, 2, 3], [1, 2, 3]])
b = Matrix([[4, 5, 6], [7, 8, 9]])
a.__str__()
b.__str__()
print(f"результат сложения 2 матриц \n {a + b}")






