# Создать (не программно) текстовый файл, в котором каждая строка должна содержать данные о фирме: название,
# форма собственности, выручка, издержки.
# Пример строки файла: firm_1 ООО 10000 5000.
# Необходимо построчно прочитать файл, вычислить прибыль каждой компании, а также среднюю прибыль.
# Если фирма получила убытки, в расчет средней прибыли ее не включать.
# Далее реализовать список. Он должен содержать словарь с фирмами и их прибылями, а также словарь со средней прибылью.
# Если фирма получила убытки, также добавить ее в словарь (со значением убытков).
# Пример списка: [{“firm_1”: 5000, “firm_2”: 3000, “firm_3”: 1000}, {“average_profit”: 2000}].
# Итоговый список сохранить в виде json-объекта в соответствующий файл.
# Пример json-объекта:
# [{"firm_1": 5000, "firm_2": 3000, "firm_3": 1000}, {"average_profit": 2000}]
# Подсказка: использовать менеджеры контекста.


import json


profit_dict = aver_profit = {}
firm_list = []
firm_count = profit = rez = 0
with open("Test-5.7.txt") as read_obj:
    for line in read_obj:
        my_list = line.split()
        f_name = my_list.pop(0)     # Выделяем название фирмы
        firm_count += 1             # Считаем кол-во фирм
        rez = int(my_list[1]) - int(my_list[2])     # Определяем прибыль
        if rez > 0:
            profit = profit + rez   # Суммируем прибыль если она есть
        profit_dict[f_name] = rez
rez = int(profit/firm_count)        # Расчитываем среднюю прибыль
aver_profit = {'average_profit': rez}
firm_list = [profit_dict, aver_profit]


with open("Test-5.7.json", "w") as write_f:
    json.dump(firm_list, write_f)


