# Создать (программно) текстовый файл, записать в него программно набор чисел,разделенных пробелами.
# Программа должна подсчитывать сумму чисел в файле и выводить ее на экран.


my_list = [el for el in range(1, 20)]
with open("test-5.5.txt", "w")as w_obg:
    for i in my_list:
        w_obg.write(str(i) + " ")
    print("Сумма всех чисел в файле - ", sum(my_list))
