# Создайте собственный класс-исключение, который должен проверять содержимое списка на наличие только чисел.
# Проверить работу исключения на реальном примере. Необходимо запрашивать у пользователя данные и заполнять список.
# Класс-исключение должен контролировать типы данных элементов списка.


class OwnError(Exception):

    def __init__(self, txt):
        self.text = txt

    print("Для выхода из программы введите пустую строку.")


my_list = []
try:
    while True:
        a = input("Введите любое число  - ")
        if not a:
            print(f"Программа завершена корректно. Результат - {my_list}")
            break
        if not a.isdigit():
            raise OwnError(f"Программа завершена после ошибки. Вы ввели не число! Результат - {my_list}")
        else:
            my_list.append(a)
except OwnError as err:
    print(err)

